In [48]:
import pandas as pd
pd.Series?

In [8]:
animal = ["tiger", "cat", "dog"]
a = pd.Series(animal)
a

0    tiger
1      cat
2      dog
dtype: object

In [12]:
a.index

RangeIndex(start=0, stop=3, step=1)

In [14]:
lei = {"lei":1, "ming" : 2, "lm":3}
lei

{'lei': 1, 'lm': 3, 'ming': 2}

In [16]:
pd.Series(lei)

lei     1
lm      3
ming    2
dtype: int64

In [27]:
s = pd.Series(lei, index=["lei", "ming", "lm"])
s

lei     1
ming    2
lm      3
dtype: int64

In [34]:
s.loc["ming"]

2

In [37]:
import numpy as np
s = pd.Series(np.random.randint(0,1000,10000))
s.head()

0    166
1    776
2    620
3    656
4    981
dtype: int64

In [39]:
np.sum(s)

4977826L

In [43]:
b = pd.Series(np.random.randint(0,1000,10000))
b.head()

0    461
1    141
2    499
3    378
4    151
dtype: int64

In [45]:
s.append(b)

0       166
1       776
2       620
3       656
4       981
5       155
6       551
7       479
8       610
9       416
10       41
11      777
12      706
13       88
14      419
15      688
16      277
17      353
18      253
19      523
20      582
21      517
22      825
23      405
24      556
25      673
26      696
27      538
28      674
29      202
       ...
9970    150
9971    560
9972    563
9973    238
9974    424
9975    244
9976    949
9977     45
9978    941
9979    760
9980    669
9981    890
9982    779
9983    771
9984    181
9985    525
9986    426
9987     75
9988    486
9989    634
9990    473
9991    542
9992     35
9993    909
9994    317
9995    248
9996    910
9997    186
9998    985
9999    476
Length: 20000, dtype: int64

In [47]:
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})
df = pd.DataFrame([purchase_1, purchase_2, purchase_3])
df

   Cost Item Purchased   Name
0  22.5       Dog Food  Chris
1   2.5   Kitty Litter  Kevyn
2   5.0      Bird Seed  Vinod

In [51]:
df.iloc[2]

Cost                      5
Item Purchased    Bird Seed
Name                  Vinod
Name: 2, dtype: object

In [54]:
df.T

                       0             1          2
Cost                22.5           2.5          5
Item Purchased  Dog Food  Kitty Litter  Bird Seed
Name               Chris         Kevyn      Vinod

In [56]:
df.T.loc["Cost"]

0    22.5
1     2.5
2       5
Name: Cost, dtype: object

In [58]:
df.loc[:, "Cost"]

0    22.5
1     2.5
2     5.0
Name: Cost, dtype: float64

In [62]:
df_copy = df.copy()
df_copy.drop(0)

   Cost Item Purchased   Name
1   2.5   Kitty Litter  Kevyn
2   5.0      Bird Seed  Vinod

In [71]:
df_copy

  Item Purchased
0       Dog Food
1   Kitty Litter
2      Bird Seed

In [72]:
df["location"] = None
df

   Cost Item Purchased   Name location
0  22.5       Dog Food  Chris     None
1   2.5   Kitty Litter  Kevyn     None
2   5.0      Bird Seed  Vinod     None

In [75]:
from sklearn.datasets import load_boston
print load_boston

<function load_boston at 0x1113d4140>

In [ ]:
type(load_boston)

In [ ]:
df = pd.read_csv("boston.csv", sep="\s+")
df.head()

In [ ]:
df = pd.read_csv("boston.csv", sep="\s+", index_col=0, skiprows=0)
df.head()

In [19]:
import pandas as pd
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})

df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index=['Store 1', 'Store 1', 'Store 2'])
df = df.set_index([df.index, "Name"])
df.index.names = ["Location", "Name"]
df = df.append(pd.Series(data={'Cost': 3.0, 'Item Purchased':'Kitty Food'}, name=('Store 3', 'lei')))
df

                Cost Item Purchased
Location Name
Store 1  Chris  22.5       Dog Food
         Kevyn   2.5   Kitty Litter
Store 2  Vinod   5.0      Bird Seed
Store 3  lei     3.0     Kitty Food

In [20]:
#获取每个人的各科最高的分数

data = {'name' : ['bill', 'joe', 'steve'],
    'test1' : [85, 75, 85],
    'test2' : [35, 45, 83],
     'test3' : [51, 61, 45]}
frame = pd.DataFrame(data)
frame['HighScore'] = frame[['test1', 'test2', 'test3']].max(axis=1)
frame

    name  test1  test2  test3  HighScore
0   bill     85     35     51         85
1    joe     75     45     61         75
2  steve     85     83     45         85

In [46]:
#谁在test1中的分数最高

data = {'name' : ['bill', 'joe', 'steve'],
    'test1' : [85, 75, 85],
    'test2' : [35, 45, 83],
     'test3' : [51, 61, 45]}
frame = pd.DataFrame(data)
frame.loc[frame['test1'].idxmax()]['name']

'bill'

In [39]:
data = {'count' : [8, 9, 10,20],
    'job' : ['sales', 'sales', 'marks', 'sales'],
    'source' : ['a', 'b', 'a', 'b']}
frame = pd.DataFrame(data)
#frame
frame.groupby(['job','source']).agg({'count':sum})

              count
job   source
marks a          10
sales a           8
      b          29

In [47]:
#返回前三个最大的
import numpy as np
s = pd.Series(np.random.randn(10**6))
s.nlargest(3)

158389    4.846276
659266    4.705105
167140    4.591760
dtype: float64